// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

let numberOne = +prompt('Введіть перше число');
let numberTwo = +prompt('Введіть ддруге число');

if (numberOne > numberTwo) {
    document.write(`<h1>Максимальне число: ${numberOne}</h1>`);
} else if (numberOne < numberTwo) {
    document.write(`<h1>Максимальне число: ${numberTwo}</h1>`);
} else {
    document.write('<h1>Числа рівні</h1>');
}

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let apartmentNumber = +prompt('Введіть номер квартири');

if (apartmentNumber > 0 && apartmentNumber <= 20) {
    document.write('<h1>Перший пізїзд</h1>');
} else if (apartmentNumber > 20 && apartmentNumber <= 48) {
    document.write('<h1>Другий підїзд</h1>');
} else if (apartmentNumber > 48 && apartmentNumber <= 98) {
    document.write('<h1>Третій підїзд</h1>');
} else {
    document.write('<h1>Такої квартири не існує! введіть номер від 1 до 98</h1>');
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number = +prompt('Введіть число');
if (number === 10 ) {
    document.write('<h1>Вірно</h1>');
} else {
    document.write('<h1>Невірно</h1>');
}

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// Для перевіряючого змінюйте тип змінної
let x = {};
let type = typeof x;

if (type === 'number') {
    console.log(1);
} else if (type === 'string') {
    console.log(2);
} else if (type === 'boolean') {
    console.log(3);
} else if (type === 'object') {
    console.log(4);
}

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let t = 22;

if (t > 9 && t < 23) {
    console.log('йдемо ВЧИТИСЯ');
} else {
    console.log('вчимося ОНЛАЙН');
}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
{
    let number = +prompt('Введіть число від 1 до 5');
    switch (number) {
        case 1:
            alert('Ви виграли Автомобіль!');
            break;
        case 2:
            alert('Ви виграли Мотоцикл!');
            break;
        case 3:
            alert('Ви виграли Телефон!');
            break;
        case 4:
            alert('Ви виграли Годинник!');
            break;
        case 5:
            alert('Ви виграли Ноутбук!');
            break;
        default:
            alert('Число не вірне!');
    }
}




