// - Дано натуральное число n. Выведите все числа от 1 до n.
// const log = (n) => {
//     for (let i = 1; i <= n; i++) {
//         console.log(i);
//     }
// }
// log(10);

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// const log = (a, b) => {
//     if (a < b) {
//         for (let i = a; i <= b; i++) {
//             console.log(i);
//         }
//     } else {
//         for (let i = a; i >= b; i--) {
//             console.log(i);
//         }
//     }
// }
// log(5, 10);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// const arr = [9,8,0,4];
// const foo = (arr, i) => {
//     for (let j = 0; j < arr.length; j++) {
//         if (i === j) {
//             let tmp = arr[i];
//             arr[j] = arr[j + 1];
//             arr[j + 1] = tmp;
//         }
//     }
//     return arr;
// }
//
// console.log(foo(arr, 2));


// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

// const arr = [1, 0, 6, 0, 3, 5, 0, 0, 7, 8, 0];
// const transfer = (arr) => {
//     const newArr = [];
//     let zero = 0;
//     for (let i = 0; i < arr.length; i++) {
//         if (arr[i] === 0) {
//             zero++;
//         } else {
//             newArr.push(arr[i]);
//         }
//     }
//     for (let i = 0; i < zero; i++) {
//         newArr.push(0);
//     }
//     return newArr;
// }
// console.log(transfer(arr));


