// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3) {
    alert('це великий масив, в якому  3 і більше елементи');
} else {
    alert('це маленький масив, в якому менше 3-х елементів');
}

// - Маємо 3 числа і між ним нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let numberOne = +prompt('Введіть перше число');
let numberTwo = +prompt('Введіть друге число');
let numberThree = +prompt('Введіть третє число');

const arr = [numberOne,numberTwo,numberThree];

const res = arr.sort((a, b) => a - b);
alert(res[1]);

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let result;
a + b < 4 ? result = 'Мало' : result = 'Багато'

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = +prompt('Введіть число від -100 до 100');

number >= -100 && number <= 100 ?
    number === 0 ?
        alert('Нуль') :
        number < 0 ?
            alert('Негативне') :
            alert('Позитивне') :
    alert('Число має бути в діапазоні від -100 до 100');


